      ******************************************************************
       IDENTIFICATION                  DIVISION.
      ******************************************************************
       PROGRAM-ID. GHTML01.
       AUTHOR. NEUCLAIR J. ANGELE JR.
       DATE-WRITTEN. 18 MAI 2011.
       DATE-COMPILED.
      *REMARKS. *******************************************************
      *         *#NOME:# GHTML                                        *
      *         *******************************************************
      *         *#FUNC:# GERAR ARQUIVO HTML                           *
      *         *******************************************************
      *         *#ANALISTA:# NEUCLAIR J. ANGELE JR.                   *
      *         *******************************************************
      *
      ******************************************************************
       ENVIRONMENT                     DIVISION.
      ******************************************************************
      *
      ******************************************************************
       CONFIGURATION                   SECTION.
      ******************************************************************
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      *
      ******************************************************************
       INPUT-OUTPUT                    SECTION.
      ******************************************************************
       FILE-CONTROL.
           SELECT SYS020 ASSIGN TO 'index.html'
                  ORGANIZATION  IS LINE SEQUENTIAL
                  FILE   STATUS IS WS-FS-SYS020.
      *
      ******************************************************************
       DATA                            DIVISION.
      ******************************************************************
      *
      ******************************************************************
       FILE                            SECTION.
      ******************************************************************
       FD  SYS020
           RECORDING MODE   IS F
           LABEL     RECORD IS STANDARD
           BLOCK     CONTAINS  0 RECORDS.
       01          FD-REG-HTML     PIC     X(80).
      *
      ******************************************************************
       WORKING-STORAGE                 SECTION.
      ******************************************************************
       77          FILLER          PIC     X(32)         VALUE
                                   'III WORKING-STORAGE SECTION III'.
      *
       01          WS-WORKING.
      *
      ******************************************************************
      *                           FILE STATUS                          *
      ******************************************************************
           03      WS-FILE-STATUS.
             05    FILLER          PIC     X(12)         VALUE
                                   'FILE STATUS'.
             05    WS-FS-SYS020    PIC     X(02)         VALUE ZEROS.
      *
      ******************************************************************
      *                           HTML                                 *
      ******************************************************************
           03      WS-HTML.
             05    WS-HTML-I       PIC     X(80)         VALUE
                                   '<HTML>'.
             05    WS-HEAD-I       PIC     X(80)         VALUE
                                   '<HEAD>'.
             05    WS-TITLE.
               07  WS-TITLE-I      PIC     X(07)         VALUE
                                   '<TITLE>'.
               07  WS-TITLE-T      PIC     X(65)         VALUE SPACES.
               07  WS-TITLE-F      PIC     X(08)         VALUE
                                   '</TITLE>'.
             05    WS-HEAD-F       PIC     X(80)         VALUE
                                   '</HEAD>'.
             05    WS-BODY-I       PIC     X(80)         VALUE
                                   '<BODY TEXT="RED" BGCOLOR="BLUE">'.
             05    WS-BODY-T.
               07  WS-LINHA OCCURS 20 TIMES INDEXED BY WS-IND.
                09 WS-TEXTO        PIC     X(80)         VALUE SPACES.
             05    WS-BODY-F       PIC     X(80)         VALUE
                                   '</BODY>'.
             05    WS-HTML-F       PIC     X(80)         VALUE
                                   '</HTML>'.

      ******************************************************************
      *                           AUXILIARES                           *
      ******************************************************************
           03      WS-AUXILIARES.
             05    FILLER          PIC     X(12)         VALUE
                                   'AUXILIARES'.
      *
      ******************************************************************
      *                          ACUMULADORES                          *
      ******************************************************************
           03      WS-ACUMULADORES.
             05    FILLER          PIC     X(12)         VALUE
                                   'ACUMULADORES'.
      *
      ******************************************************************
      *                           SUBROTINAS                           *
      ******************************************************************
           03      WS-SUBROTINAS.
             05    FILLER          PIC     X(12)         VALUE
                                   'SUBROTINAS'.
      *
      ******************************************************************
      *                          AREA DE DB2                           *
      ******************************************************************
           03      WS-DB2.
             05    FILLER          PIC     X(12)         VALUE 'DB2'.
      *
      ******************************************************************
      *                           COPYBOOKS                            *
      ******************************************************************
      *
      *
      ******************************************************************
      *
       01          FILLER          PIC     X(32)         VALUE
                                   'FFF FIM DA WORKING-STORAGE FFF'.
      *
      ******************************************************************
       LINKAGE                         SECTION.
      ******************************************************************
      *
      *
      ******************************************************************
       PROCEDURE                       DIVISION.
      ******************************************************************
      ******************************************************************
      *                        ROTINA PRINCIPAL                        *
      ******************************************************************
       RTPRINCIPAL                     SECTION.
      ******************************************************************
      *
           PERFORM RTINICIAR.
      *
           PERFORM RTPROCESSAR.
      *
           PERFORM RTFINALIZAR.
      *
      ******************************************************************
       RTPRINCIPAL-EXIT.               EXIT.
      ******************************************************************
      ******************************************************************
      *                         ROTINA INICIAL                         *
      ******************************************************************
       RTINICIAR                       SECTION.
      ******************************************************************
      *
           OPEN OUTPUT SYS020.
      *
           WRITE FD-REG-HTML           FROM WS-HTML-I.
           WRITE FD-REG-HTML           FROM WS-HEAD-I.
           MOVE  'TESTE COBOL'         TO   WS-TITLE-T.
           WRITE FD-REG-HTML           FROM WS-TITLE.
           WRITE FD-REG-HTML           FROM WS-HEAD-F.
           WRITE FD-REG-HTML           FROM WS-BODY-I.
           MOVE  '<H1><P ALIGN="CENTER"><MARQUEE>HELLO WORLD!</MARQUEE><
      -          '/P></H1>'
                                       TO   WS-TEXTO(1).
           MOVE  '<HR SIZE=10 COLOR="GREEN">'
                                       TO   WS-TEXTO(2).
           MOVE  '<H2><BLINK>ISSO NAO FAZ NADA!!!</BLINK></H2>'
                                       TO   WS-TEXTO(3).
           WRITE FD-REG-HTML           FROM WS-TEXTO(1).
           WRITE FD-REG-HTML           FROM WS-TEXTO(2).
           WRITE FD-REG-HTML           FROM WS-TEXTO(3).

      *
      ******************************************************************
       RTINICAR-EXIT.                  EXIT.
      ******************************************************************
      ******************************************************************
      *                         ROTINA PROCESSA                        *
      ******************************************************************
       RTPROCESSAR                     SECTION.
      ******************************************************************
      *
      *
      ******************************************************************
       RTPROCESSAR-EXIT.               EXIT.
      ******************************************************************
      ******************************************************************
      *                          ROTINA FINAL                          *
      ******************************************************************
       RTFINALIZAR                     SECTION.
      ******************************************************************
      *
           WRITE FD-REG-HTML           FROM WS-BODY-F.
           WRITE FD-REG-HTML           FROM WS-HTML-F.
      *
           MOVE ZEROS                  TO RETURN-CODE.
      *
           GOBACK.
      *
      ******************************************************************
       RTFINALIZAR-EXIT.               EXIT.
      ******************************************************************
      ******************************************************************
      *                        FIM DO PROGRAMA                         *
      ******************************************************************
